export const ClubCarouselInfo = [
  {
    img: "종교분과.gif",
    name: "종교분과",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
  {
    img: "과학기술.gif",
    name: "과학기술",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
  {
    img: "스포츠.gif",
    name: "스포츠",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
  {
    img: "봉사.gif",
    name: "봉사",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
  {
    img: "연행예술.gif",
    name: "연행예술",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
  {
    img: "인문사회.gif",
    name: "인문사회",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
  {
    img: "취미교양.gif",
    name: "취미교양",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
  {
    img: "평면예술.gif",
    name: "평면예술",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
  {
    img: "학술분과.gif",
    name: "학술분과",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
];
