export const CATEGORIES_SEOUL = [
  "전체보기",
  "언행예술",
  "평면예술",
  "봉사",
  "취미교양",
  "스포츠",
  "종교",
  "학술",
  "인문사회",
];

export const CATEGORIES_SUWON = [
  "전체보기",
  "건강체육",
  "기악예술",
  "문화창작",
  "학술사회",
  "연행예술",
  "종교",
  "취미교양",
  "과학기술",
];

export const INTRO_DUMMY_DATA = {
  name: "for:동",
  section: [
    "성균관대학교 동아리연합회는 민주적인 절차를 통해 우리 대학 캠퍼스 문화의 건전한 발전을 위한 기틀을 마련하며, 동아리 관련 행정처리 및 행사 추진을 담당합니다. 동아리연합회는 중앙동아리 소속 학우들의 활동을 장려하고 지원하는 것을 넘어서, 교내 모든 동아리, 소모임, 학회 등이 이용할 수 있는 공간을 제공하고, 중앙동아리 관련 정보를 신입생에게 가장 먼저 제공하는 등 성균인 전체의 동아리 문화생활을 장려합니다.",
    "민주적 의견 수렴을 위해 상시로 운영위원회와 전체동아리대표자회의를 개최하여 상호 정보를 공유하고, 의결사항을 결정하고, 건의 및 논의안건에 대해 의견을 나눕니다. 소통창구를 통해 항상 학내 구성원의 목소리에 귀를 기울이고 있습니다. 동아리연합회는 특별기구로 중앙운영위원회를 구성하고, 학생자치활동에 적극적으로 참여합니다. 학내 모든 동아리인의 목소리를 대변하고, 서로 다른 목소리와 의견을 한데 모아 함께 논의하는 과정을 통해 최선을 향해 나아가려 노력합니다. 동아리연합회는 성균관대학교 전체 학생사회의 발전을 위해 불철주야 노력하고 있습니다.",
    "동아리연합회는 원활한 업무수행을 위해 5개의 집행국과 2개의 특별사무팀으로 구성됩니다. 대내사업국, 비서소통국, 사무국, 행사기획국, 홍보국의 5국과 총무팀, 디자인팀의 2팀이 서로 소통하며 업무를 함께 추진하고 있습니다. 이렇게 진행되는 상시사업과 공약사업의 이행과정은 학우들에게 투명하게 공개됩니다. 각 국의 업무는 아래와 같습니다.",
  ],
  department: [
    {
      name: "사무국",
      emoji: "✏️",
      description:
        "사무국은 전체적인 동아리 활동에 필요한 상시서류를 작성하고, 신규등록 및 재등록 관련 업무를 진행합니다. 징계 및 경고 동아리를 관리하고, 동아리연합회 집행부회의, 전체동아리대표자회의 및 운영위원회의에 참석하여 회의록을 작성하고 관리합니다.",
    },
    ,
    {
      name: "사무국 총무팀",
      emoji: "💎",
      description:
        "사무국 소속 총무팀은 성균관대학교 중앙동아리의 원활한 활동을 보조하기 위해 동아리연합회 전반의 재정 관련 업무를 수행합니다. 경상보조금, 회장장학금, 행사지원금의 지급 관련 행정을 전담합니다. 또한 동아리연합회 사업 운영을 위한 학생회비 예산 수립, 집행, 학기별 결산을 전문적으로 담당합니다.",
    },
    {
      name: "비서 소통국",
      emoji: "💞",
      description:
        "비서소통국은 회장단이 원활하게 업무를 수행할 수 있도록 회장단을 보조하며, 본회 소속 중앙동아리 대표자와의 소통과 SKKLUB 웹사이트 관리 등을 담당합니다. 중앙동아리 대표자와 동아리연합회 사이 징검다리 역할을 하며, 고충을 접수하고 문제를 해결하기 위해 노력합니다. 공용공간 대여사업 및 복지물품 대여사업을 진행하며, 익명 소통함을 관리하여 회장단에게 내용을 전달합니다.",
    },
    {
      name: "대내사업국",
      emoji: "💪",
      description:
        "대내사업국은 동아리연합회 내부운영에 초점을 맞추어 동아리인의 복지사업을 담당합니다. 동아리 운영의 편의와 효율을 고려하여 사업을 기획하고, 원활한 활동이 이루어질 수 있도록 소속 중앙동아리를 지원합니다.",
    },
    {
      name: "행사기획국",
      emoji: "🎉",
      description:
        "행사기획국은 동아리연합회와 관련된 행사나 대외적인 사업 전반의 기획과 진행 전 과정을 담당합니다. 중앙동아리의 더 나은 활동을 보장하기 위해 사업을 기획하고, 그 과정에서 다양한 아이디어를 제시합니다. 동아리 홍보부스와 동아리의 밤 행사 등을 직접 수행합니다.",
    },
    {
      name: "홍보국",
      emoji: "🔊",
      description:
        "홍보국은 동아리연합회의 홍보와 문의답변과 관련된 업무를 담당합니다. 동아리연합회에서 진행하는 각종 행사들과 중앙동아리의 소식을 종합하여 홍보합니다. SNS 계정을 관리하며, 동아리 관련 문의에 답변하는 소통창구의 역할도 겸행합니다.",
    },
    {
      name: "홍보국 디자인팀",
      emoji: "🎨",
      description:
        "홍보국 소속 디자인팀은 동아리 홍보책자, 카드뉴스와 영상을 포함한 SNS 콘텐츠 일체를 직접 디자인하고 이를 활용해 홍보사업을 수행합니다. 시각적인 디자인 업무를 전문적으로 담당합니다.",
    },
  ],
};

export const RECOMMENDATION_COMMENT_SUWON = [
  {
    category: "언행예술",
    description: "넘치는 끼와 에너지를 자유롭게 발산해보세요!",
    hashtags: ["무대", "공연", "축제", "열정"],
  },
  {
    category: "문화창작",
    description: "여러분의 감각을 담은 새로운 작품을 창조해보세요!",
    hashtags: ["영상매체", "사진", "미술", "작품"],
  },
  {
    category: "과학기술",
    description: "아무리 어려운 것이라도, 함께라면 막힘없이 풀 수 있을 거예요!",
    hashtags: ["탐구", "과학", "프로젝트", "공모전"],
  },
  {
    category: "취미교양",
    description: "같은 취미를 공유하는 친구들과 대학 생활의 추억을 쌓아보세요!",
    hashtags: ["새로움", "설레는", "즐거움", "교류"],
  },
  {
    category: "학술사회",
    description:
      "도움이 필요한 곳에 행복을 나누거나 인문학적 고민을 함께 사색하는 교류의 공간입니다.",
    hashtags: ["토론", "봉사", "친구", "이야기"],
  },
  {
    category: "종교",
    description: "사랑과 자비로 맞이하는 세상은 생각보다 따스할 지 몰라요!",
    hashtags: ["사랑", "자비", "평화", "화합"],
  },
  {
    category: "건강체육",
    description:
      "낯설게 느껴지는 종목이더라도 함께라면 두려움이 아닌 즐거움으로 다가올 거예요!",
    hashtags: ["운동", "스포츠", "협동", "경쟁"],
  },
  {
    category: "기악예술",
    description: "여러분의 음표를 더하여 오선지의 마지막을 완성하세요!",
    hashtags: ["화음", "어올림", "밴드", "추억"],
  },
];

export const CAROUSEL_COMMENT_SEOUL = [
  {
    img: "종교분과.gif",
    name: "나에게는\n어떤 동아리가\n어울릴까",
    content:
      "옆으로 넘기면서 성균관대학교에는\n어떤 동아리들이 있는지 살펴보세요.",
  },
  {
    img: "과학기술.gif",
    name: "과학기술",
    content:
      "과학기술분과는 자연과학, 공학, 기술 등 관심 분야를 탐구하는 지식의 바다입니다. 아무리 어려운 것이라도, 함께라면 막힘없이 풀 수 있을 거예요!",
  },
  {
    img: "스포츠.gif",
    name: "스포츠",
    content:
      "스포츠분과는 신체활동을 통해 체력증진을 돕는 우리들의 운동장입니다. 낯설게 느껴지는 종목이더라도 함께라면 두려움이 아닌 즐거움으로 다가올 거예요!",
  },
  {
    img: "봉사.gif",
    name: "봉사",
    content:
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.",
  },
  {
    img: "연행예술.gif",
    name: "연행예술",
    content:
      "연행예술분과는 무대에서 스스로를 표현하는 예술의 공간입니다. 넘치는 끼와 에너지를 자유롭게 발산해보세요!",
  },
  {
    img: "종교분과.gif",
    name: "종교",
    content:
      "종교분과는 다양한 종교가 모이는 화합의 공간입니다. 사랑과 자비로 맞이하는 세상은 생각보다 따스할 지 몰라요!",
  },
  {
    img: "인문사회.gif",
    name: "인문사회",
    content:
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.",
  },
  {
    img: "취미교양.gif",
    name: "취미교양",
    content:
      "취미교양분과는 게임, 여행, 커피 등 다양한 취미를 즐기는 캠퍼스의 정원입니다. 같은 취미를 공유하는 친구들과 대학 생활의 추억을 쌓아보세요!",
  },
  {
    img: "평면예술.gif",
    name: "평면예술",
    content:
      "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  },
  {
    img: "학술분과.gif",
    name: "학술",
    content:
      "학술분과는 우리 사회의 일원으로 함께할 수 있는 책임감의 장으로, 도움이 필요한 곳에 행복을 나누거나 인문학적 고민을 함께 사색하는 교류의 공간입니다.",
  },
];

export const CAROUSEL_COMMENT_SUWON = [
  {
    img: "종교분과.gif",
    name: "나에게는\n어떤 동아리가\n어울릴까",
    content:
      "옆으로 넘기면서 성균관대학교에는\n어떤 동아리들이 있는지 살펴보세요.",
  },
  {
    img: "과학기술.gif",
    name: "과학기술",
    content:
      "과학기술분과는 자연과학, 공학, 기술 등 관심 분야를 탐구하는 지식의 바다입니다. 아무리 어려운 것이라도, 함께라면 막힘없이 풀 수 있을 거예요!",
  },
  {
    img: "스포츠.gif",
    name: "건강체육",
    content:
      "건강체육분과는 신체활동을 통해 체력증진을 돕는 우리들의 운동장입니다. 낯설게 느껴지는 종목이더라도 함께라면 두려움이 아닌 즐거움으로 다가올 거예요!",
  },
  // {
  //   img: "봉사.gif",
  //   name: "봉사",
  //   content:
  //     "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  // },
  {
    img: "연행예술.gif",
    name: "연행예술",
    content:
      "연행예술분과는 무대에서 스스로를 표현하는 예술의 공간입니다. 넘치는 끼와 에너지를 자유롭게 발산해 보세요!",
  },
  {
    img: "종교분과.gif",
    name: "종교",
    content:
      "종교분과는 다양한 종교가 모이는 화합의 공간입니다. 사랑과 자비로 맞이하는 세상은 생각보다 따스할 지 몰라요!",
  },
  // {
  //   img: "인문사회.gif",
  //   name: "인문사회",
  //   content:
  //     "평면예술분과는 평면예술을 사랑하는 동아리들이 모여있습니다. 회화, 사진, 서예, 만화, 판화, 영상까지, 다양한 평면예술을 즐겨보세요!",
  // },
  {
    img: "취미교양.gif",
    name: "취미교양",
    content:
      "취미교양분과는 게임, 여행, 커피 등 다양한 취미를 즐기는 캠퍼스의 정원입니다. 같은 취미를 공유하는 친구들과 대학 생활의 추억을 쌓아보세요!",
  },
  {
    img: "평면예술.gif",
    name: "문화창작",
    content:
      "문화창작분과는 하나의 작품만으로도 감동을 선사하는 표현의 창구입니다. 여러분의 감각을 담은 새로운 작품을 창조해보세요!",
  },
  {
    img: "학술분과.gif",
    name: "학술사회",
    content:
      "학술사회분과는 우리 사회의 일원으로 함께할 수 있는 책임감의 장으로, 도움이 필요한 곳에 행복을 나누거나 인문학적 고민을 함께 사색하는 교류의 공간입니다.",
  },
  //기악예술 gif 없음
];
